perf-test/order_creation_and_supplier_poll_perf-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Orders Performance Test" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ================= CUSTOMERS ================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Customers - Create Orders" enabled="true">
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">18000</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>

        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>

        <!-- Pick Customer -->
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Pick Customer" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
def customers = [1,2,3]
vars.put("customerId", customers[new Random().nextInt(customers.size())].toString())
          ]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <!-- Pick Supplier -->
        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Pick Supplier" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
def suppliers = [1,2,3]
vars.put("supplierId", suppliers[new Random().nextInt(suppliers.size())].toString())
          ]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <!-- Build Order Payload -->
        <JSR223PreProcessor guiclass="TestBeanGUI"
                            testclass="JSR223PreProcessor"
                            testname="Build Order Payload"
                            enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
def customerId = vars.get("customerId")
def supplierId = vars.get("supplierId")

def orderLineJson

switch (supplierId as int) {
  case 1:
    orderLineJson = '{"itemId":1,"priceSnapshot":75.0,"amount":2}'
    break
  case 2:
    orderLineJson = '{"itemId":3,"priceSnapshot":90.0,"amount":1}'
    break
  case 3:
    orderLineJson = '{"itemId":5,"priceSnapshot":40.0,"amount":2}'
    break
}

def jsonBody = """
{
  "customerId": ${customerId},
  "supplierId": ${supplierId},
  "status": "created",
  "paymentMethod": "PAYPAL",
  "orderLines": [${orderLineJson}]
}
"""

vars.put("orderPayload", jsonBody.trim())
          ]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <!-- Create Order -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui"
                          testclass="HTTPSamplerProxy"
                          testname="Create Order"
                          enabled="true">

          <stringProp name="HTTPSampler.domain">172.16.0.11</stringProp>
          <stringProp name="HTTPSampler.port">7071</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/createorder</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>

          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>

          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${orderPayload}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>

        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>

        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Order Rate" enabled="true">
          <doubleProp>
            <name>throughput</name>
            <value>140</value>
          </doubleProp>
          <intProp name="calcMode">0</intProp>
        </ConstantThroughputTimer>
        <hashTree/>

      </hashTree>

      <!-- ================= SUPPLIERS ================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Suppliers - Poll Orders" enabled="true">
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">120</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">18000</stringProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>

        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController"
                     testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>

        <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="Pick Supplier" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script"><![CDATA[
def suppliers = [1,2,3]
vars.put("supplierId", suppliers[new Random().nextInt(suppliers.size())].toString())
          ]]></stringProp>
        </JSR223PreProcessor>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Poll Supplier Orders" enabled="true">
          <stringProp name="HTTPSampler.domain">172.16.0.11</stringProp>
          <stringProp name="HTTPSampler.port">7073</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/orders?supplierId=${supplierId}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Poll Every 5s" enabled="true">
          <stringProp name="ConstantTimer.delay">10000</stringProp>
        </ConstantTimer>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>